cask_args appdir: "/Applications"

# Taps
# ----------------------------------------------------------------------------
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/services"

# Packages
# ----------------------------------------------------------------------------
brew "ack"
brew "awscli"
brew "cmake"
brew "ctags"
brew "dep"
brew "fd"
brew "fzf"
brew "git"
brew "gnu-sed"
brew "go"
brew "grc"
brew "gzip"
brew "htop-osx"
brew "httpie"
brew "hub"
brew "jq"
brew "luarocks"
brew "neovim", args: ['HEAD']
brew "nmap"
brew "nodenv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ruby-build"
brew "rust"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "wget"
brew "zsh"

# Fonts
# ----------------------------------------------------------------------------

# Monospace
cask "font-fira-code"
cask "font-hack"
cask "font-hasklig"
cask "font-inconsolata"
cask "font-metropolis"
cask "font-source-code-pro"
cask "font-ubuntu"

# Sans-serif
cask "font-league-gothic"
cask "font-roboto"

# Nerd fonts
cask "font-hack-nerd-font"

# Applications
# ----------------------------------------------------------------------------

# Browsers
cask "firefox"
cask "google-chrome"
cask "safari-technology-preview"

# Developer tools
cask "docker"

# Media
cask "beamer"
cask "calibre"
cask "sketch"
cask "spotify"
cask "vlc"

# QuickLook plugins
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-json"

# Security
cask "1password"
cask "nordvpn"

# Other
cask "bettertouchtool"
cask "iterm2"
cask "keepingyouawake"
cask "kitty"
cask "skype"
cask "slack"
cask "sublime-text"
cask "visual-studio-code"
cask "whatsapp"
